ExprovipFuel/src/Documents/Фактура/Фактура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Фактура</name>
  <attributes>
    <name>ПоследнийНомерПечати</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>флагСчитатьСкидкуОтМестаТранзакции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗаДороги</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсЗаДороги</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>8</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор77</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Транзакции</name>
    <attributes>
      <name>ДатаТранзакции</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Карта</name>
      <type>
        <types>CatalogRef.Карточки</types>
      </type>
    </attributes>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Автомобиль</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестоТранзакции</name>
      <type>
        <types>CatalogRef.МестаТранзакции</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСоСкидкой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Итого</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютнаяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Надбавка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютнаяЦенаСНадбавкой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.ФактураШаблон</types>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапОплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаПоставщика</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ФлагНеУчитывать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ExprovipFuel/src/InformationRegisters/НомераФактур/НомераФактур.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НомераФактур</name>
  <resources>
    <name>НомерФактуры</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Фактура</name>
    <type>
      <types>DocumentRef.Фактура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ExprovipFuel/src/Documents/Фактура/Forms/ПечатьФактур/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("СтруктураПечати") = Ложь Тогда
		Возврат;
	КонецЕсли;	
	ЗаполнитьТаблицуПечати(Параметры.СтруктураПечати);
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ВыбратьВсе(Команда)
	Для Каждого СтрокаТаблица Из ТаблицаПечати Цикл
		СтрокаТаблица.Выбран = Истина;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	Для Каждого СтрокаТаблица Из ТаблицаПечати Цикл
		СтрокаТаблица.Выбран = Ложь;
	КонецЦикла;	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получить последний номер печати.
// 
// Возвращаемое значение:
//  Число - Получить последний номер печати
&НаСервере
Функция ПолучитьПоследнийНомерПечати()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	МАКСИМУМ(НомераФактур.НомерФактуры) КАК ПоследнийНомерФактуры
	|ИЗ
	|	РегистрСведений.НомераФактур КАК НомераФактур";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПоследнийНомерФактуры;
	Иначе
		Возврат 0;
	КонецЕсли;		
КонецФункции	

&НаСервере
Процедура ЗаполнитьТаблицуПечати(СтруктураПечати)
	ТаблицаКлиентов = Новый ТаблицаЗначений;
	ТаблицаКлиентов.Колонки.Добавить("Клиент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаКлиентов.Колонки.Добавить("Фактура", Новый ОписаниеТипов("ДокументСсылка.Фактура"));
	ТаблицаКлиентов.Колонки.Добавить("ЭтапОплаты", Новый ОписаниеТипов("Число"));
	
	Для Каждого ЭлементМассива ИЗ СтруктураПечати.Клиенты Цикл
		НоваяСтрока = ТаблицаКлиентов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементМассива);
	КонецЦикла;	
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаКлиентов", ТаблицаКлиентов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаКлиентов.Клиент КАК Контрагент,
	|	ТаблицаКлиентов.Фактура КАК Фактура,
	|	ТаблицаКлиентов.ЭтапОплаты КАк ЭтапОплаты
	|ПОМЕСТИТЬ ВТ_ТаблицаКлиентов
	|ИЗ
	|	&ТаблицаКлиентов КАК ТаблицаКлиентов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаКлиентов.Контрагент КАК Контрагент,
	|	ВТ_ТаблицаКлиентов.Фактура,
	|	ВТ_ТаблицаКлиентов.ЭтапОплаты,
	|	ЕСТЬNULL(НомераФактур.НомерФактуры, 0) КАК НомерФактуры
	|ИЗ
	|	ВТ_ТаблицаКлиентов КАК ВТ_ТаблицаКлиентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НомераФактур КАК НомераФактур
	|		ПО ВТ_ТаблицаКлиентов.Контрагент = НомераФактур.Контрагент
	|		И ВТ_ТаблицаКлиентов.Фактура = НомераФактур.Фактура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагент,
	|	ЭтапОплаты";
	
	ПоследнийНомерПечати = ПолучитьПоследнийНомерПечати();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.НомерФактуры = 0 Тогда
			ПоследнийНомерПечати = ПоследнийНомерПечати + 1;
			НомерФактуры = ПоследнийНомерПечати;
			СоздатьНомерФактуры(Выборка.Контрагент, Выборка.Фактура, НомерФактуры);
		Иначе
			НомерФактуры = Выборка.НомерФактуры;	
		КонецЕсли;
		НоваяСтрока = ТаблицаПечати.Добавить();
		НоваяСтрока.Контрагент = Выборка.Контрагент;
		НоваяСтрока.ЭтапОплаты = Выборка.ЭтапОплаты;
		НоваяСтрока.НомерФактуры = НомерФактуры;
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура СоздатьНомерФактуры(Контрагент, Фактура, НомерФактуры)
	МенеджерЗаписи = РегистрыСведений.НомераФактур.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Контрагент = Контрагент;
	МенеджерЗаписи.Фактура = Фактура;
	МенеджерЗаписи.НомерФактуры = НомерФактуры;
	МенеджерЗаписи.Записать();
КонецПроцедуры	

#КонецОбласти
